stress_test/test_results/k6_break_test/1/axum/tool_output.txt
STDOUT:

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6_stress_test.js
        output: -

     scenarios: (100.00%) 1 scenario, 50000 max VUs, 20m30s max duration (incl. graceful stop):
              * default: Up to 50000 looping VUs for 20m0s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)


Init      [  41% ] 20716/50000 VUs initialized
default   [   0% ]

Init      [  90% ] 44902/50000 VUs initialized
default   [   0% ]

running (00m00.7s), 00002/50000 VUs, 1 complete and 0 interrupted iterations
default   [   0% ] 00002/50000 VUs  00m00.7s/20m00.0s

running (00m01.7s), 00003/50000 VUs, 10 complete and 0 interrupted iterations
default   [   0% ] 00003/50000 VUs  00m01.7s/20m00.0s

running (00m02.7s), 00005/50000 VUs, 22 complete and 0 interrupted iterations
default   [   0% ] 00005/50000 VUs  00m02.7s/20m00.0s

running (00m03.7s), 00007/50000 VUs, 42 complete and 0 interrupted iterations
default   [   0% ] 00007/50000 VUs  00m03.7s/20m00.0s

running (00m04.7s), 00008/50000 VUs, 65 complete and 0 interrupted iterations
default   [   0% ] 00008/50000 VUs  00m04.7s/20m00.0s

running (00m05.7s), 00010/50000 VUs, 89 complete and 0 interrupted iterations
default   [   0% ] 00010/50000 VUs  00m05.7s/20m00.0s

running (00m06.7s), 00012/50000 VUs, 123 complete and 0 interrupted iterations
default   [   1% ] 00012/50000 VUs  00m06.7s/20m00.0s

running (00m07.7s), 00013/50000 VUs, 163 complete and 0 interrupted iterations
default   [   1% ] 00013/50000 VUs  00m07.7s/20m00.0s

running (00m08.7s), 00015/50000 VUs, 206 complete and 0 interrupted iterations
default   [   1% ] 00015/50000 VUs  00m08.7s/20m00.0s

running (00m09.7s), 00017/50000 VUs, 253 complete and 0 interrupted iterations
default   [   1% ] 00017/50000 VUs  00m09.7s/20m00.0s

running (00m10.7s), 00018/50000 VUs, 304 complete and 0 interrupted iterations
default   [   1% ] 00018/50000 VUs  00m10.7s/20m00.0s

running (00m11.7s), 00020/50000 VUs, 356 complete and 0 interrupted iterations
default   [   1% ] 00020/50000 VUs  00m11.7s/20m00.0s

running (00m12.7s), 00021/50000 VUs, 421 complete and 0 interrupted iterations
default   [   1% ] 00021/50000 VUs  00m12.7s/20m00.0s

running (00m13.7s), 00023/50000 VUs, 489 complete and 0 interrupted iterations
default   [   1% ] 00023/50000 VUs  00m13.7s/20m00.0s

running (00m14.7s), 00025/50000 VUs, 570 complete and 0 interrupted iterations
default   [   1% ] 00025/50000 VUs  00m14.7s/20m00.0s

running (00m15.7s), 00026/50000 VUs, 654 complete and 0 interrupted iterations
default   [   1% ] 00026/50000 VUs  00m15.7s/20m00.0s

running (00m16.7s), 00028/50000 VUs, 736 complete and 0 interrupted iterations
default   [   1% ] 00028/50000 VUs  00m16.7s/20m00.0s

running (00m17.7s), 00030/50000 VUs, 823 complete and 0 interrupted iterations
default   [   1% ] 00030/50000 VUs  00m17.7s/20m00.0s

running (00m18.7s), 00031/50000 VUs, 915 complete and 0 interrupted iterations
default   [   2% ] 00031/50000 VUs  00m18.7s/20m00.0s

running (00m19.7s), 00033/50000 VUs, 1012 complete and 0 interrupted iterations
default   [   2% ] 00033/50000 VUs  00m19.7s/20m00.0s

running (00m20.7s), 00035/50000 VUs, 1113 complete and 0 interrupted iterations
default   [   2% ] 00035/50000 VUs  00m20.7s/20m00.0s

running (00m21.7s), 00036/50000 VUs, 1221 complete and 0 interrupted iterations
default   [   2% ] 00036/50000 VUs  00m21.7s/20m00.0s

running (00m22.7s), 00038/50000 VUs, 1336 complete and 0 interrupted iterations
default   [   2% ] 00038/50000 VUs  00m22.7s/20m00.0s

running (00m23.7s), 00040/50000 VUs, 1462 complete and 0 interrupted iterations
default   [   2% ] 00040/50000 VUs  00m23.7s/20m00.0s

running (00m24.7s), 00041/50000 VUs, 1588 complete and 0 interrupted iterations
default   [   2% ] 00041/50000 VUs  00m24.7s/20m00.0s

running (00m25.7s), 00043/50000 VUs, 1717 complete and 0 interrupted iterations
default   [   2% ] 00043/50000 VUs  00m25.7s/20m00.0s

running (00m26.7s), 00045/50000 VUs, 1848 complete and 0 interrupted iterations
default   [   2% ] 00045/50000 VUs  00m26.7s/20m00.0s

running (00m27.7s), 00046/50000 VUs, 2000 complete and 0 interrupted iterations
default   [   2% ] 00046/50000 VUs  00m27.7s/20m00.0s

running (00m28.7s), 00048/50000 VUs, 2154 complete and 0 interrupted iterations
default   [   2% ] 00048/50000 VUs  00m28.7s/20m00.0s

running (00m29.7s), 00050/50000 VUs, 2303 complete and 0 interrupted iterations
default   [   2% ] 00050/50000 VUs  00m29.7s/20m00.0s

running (00m30.7s), 00051/50000 VUs, 2462 complete and 0 interrupted iterations
default   [   3% ] 00051/50000 VUs  00m30.7s/20m00.0s

running (00m31.7s), 00053/50000 VUs, 2622 complete and 0 interrupted iterations
default   [   3% ] 00053/50000 VUs  00m31.7s/20m00.0s

running (00m32.7s), 00054/50000 VUs, 2780 complete and 0 interrupted iterations
default   [   3% ] 00054/50000 VUs  00m32.7s/20m00.0s

running (00m33.7s), 00056/50000 VUs, 2953 complete and 0 interrupted iterations
default   [   3% ] 00056/50000 VUs  00m33.7s/20m00.0s

running (00m34.7s), 00058/50000 VUs, 3129 complete and 0 interrupted iterations
default   [   3% ] 00058/50000 VUs  00m34.7s/20m00.0s

running (00m35.7s), 00059/50000 VUs, 3311 complete and 0 interrupted iterations
default   [   3% ] 00059/50000 VUs  00m35.7s/20m00.0s

running (00m36.7s), 00061/50000 VUs, 3501 complete and 0 interrupted iterations
default   [   3% ] 00061/50000 VUs  00m36.7s/20m00.0s

running (00m37.7s), 00063/50000 VUs, 3694 complete and 0 interrupted iterations
default   [   3% ] 00063/50000 VUs  00m37.7s/20m00.0s

running (00m38.7s), 00064/50000 VUs, 3899 complete and 0 interrupted iterations
default   [   3% ] 00064/50000 VUs  00m38.7s/20m00.0s

running (00m39.7s), 00066/50000 VUs, 4100 complete and 0 interrupted iterations
default   [   3% ] 00066/50000 VUs  00m39.7s/20m00.0s

running (00m40.7s), 00068/50000 VUs, 4303 complete and 0 interrupted iterations
default   [   3% ] 00068/50000 VUs  00m40.7s/20m00.0s

running (00m41.7s), 00069/50000 VUs, 4528 complete and 0 interrupted iterations
default   [   3% ] 00069/50000 VUs  00m41.7s/20m00.0s

running (00m42.7s), 00071/50000 VUs, 4744 complete and 0 interrupted iterations
default   [   4% ] 00071/50000 VUs  00m42.7s/20m00.0s

running (00m43.7s), 00073/50000 VUs, 4964 complete and 0 interrupted iterations
default   [   4% ] 00073/50000 VUs  00m43.7s/20m00.0s

running (00m44.7s), 00074/50000 VUs, 5187 complete and 0 interrupted iterations
default   [   4% ] 00074/50000 VUs  00m44.7s/20m00.0s

running (00m45.7s), 00076/50000 VUs, 5426 complete and 0 interrupted iterations
default   [   4% ] 00076/50000 VUs  00m45.7s/20m00.0s

running (00m46.7s), 00078/50000 VUs, 5672 complete and 0 interrupted iterations
default   [   4% ] 00078/50000 VUs  00m46.7s/20m00.0s

running (00m47.7s), 00079/50000 VUs, 5921 complete and 0 interrupted iterations
default   [   4% ] 00079/50000 VUs  00m47.7s/20m00.0s

running (00m48.7s), 00081/50000 VUs, 6186 complete and 0 interrupted iterations
default   [   4% ] 00081/50000 VUs  00m48.7s/20m00.0s

running (00m49.7s), 00083/50000 VUs, 6457 complete and 0 interrupted iterations
default   [   4% ] 00083/50000 VUs  00m49.7s/20m00.0s

running (00m50.7s), 00084/50000 VUs, 6736 complete and 0 interrupted iterations
default   [   4% ] 00084/50000 VUs  00m50.7s/20m00.0s

running (00m51.7s), 00086/50000 VUs, 7009 complete and 0 interrupted iterations
default   [   4% ] 00086/50000 VUs  00m51.7s/20m00.0s

running (00m52.7s), 00087/50000 VUs, 7294 complete and 0 interrupted iterations
default   [   4% ] 00087/50000 VUs  00m52.7s/20m00.0s

running (00m53.7s), 00089/50000 VUs, 7571 complete and 0 interrupted iterations
default   [   4% ] 00089/50000 VUs  00m53.7s/20m00.0s

running (00m54.7s), 00091/50000 VUs, 7881 complete and 0 interrupted iterations
default   [   5% ] 00091/50000 VUs  00m54.7s/20m00.0s

running (00m55.7s), 00092/50000 VUs, 8188 complete and 0 interrupted iterations
default   [   5% ] 00092/50000 VUs  00m55.7s/20m00.0s

running (00m56.7s), 00094/50000 VUs, 8467 complete and 0 interrupted iterations
default   [   5% ] 00094/50000 VUs  00m56.7s/20m00.0s

running (00m57.7s), 00096/50000 VUs, 8763 complete and 0 interrupted iterations
default   [   5% ] 00096/50000 VUs  00m57.7s/20m00.0s

running (00m58.7s), 00097/50000 VUs, 9075 complete and 0 interrupted iterations
default   [   5% ] 00097/50000 VUs  00m58.7s/20m00.0s

running (00m59.7s), 00099/50000 VUs, 9392 complete and 0 interrupted iterations
default   [   5% ] 00099/50000 VUs  00m59.7s/20m00.0s

running (01m00.7s), 00102/50000 VUs, 9710 complete and 0 interrupted iterations
default   [   5% ] 00102/50000 VUs  01m00.7s/20m00.0s

running (01m01.7s), 00105/50000 VUs, 10044 complete and 0 interrupted iterations
default   [   5% ] 00105/50000 VUs  01m01.7s/20m00.0s

running (01m02.7s), 00109/50000 VUs, 10381 complete and 0 interrupted iterations
default   [   5% ] 00109/50000 VUs  01m02.7s/20m00.0s

running (01m03.7s), 00112/50000 VUs, 10736 complete and 0 interrupted iterations
default   [   5% ] 00112/50000 VUs  01m03.7s/20m00.0s

running (01m04.7s), 00115/50000 VUs, 11097 complete and 0 interrupted iterations
default   [   5% ] 00115/50000 VUs  01m04.7s/20m00.0s

running (01m05.7s), 00119/50000 VUs, 11488 complete and 0 interrupted iterations
default   [   5% ] 00119/50000 VUs  01m05.7s/20m00.0s

running (01m06.7s), 00122/50000 VUs, 11853 complete and 0 interrupted iterations
default   [   6% ] 00122/50000 VUs  01m06.7s/20m00.0s

running (01m07.7s), 00125/50000 VUs, 12249 complete and 0 interrupted iterations
default   [   6% ] 00125/50000 VUs  01m07.7s/20m00.0s

running (01m08.7s), 00129/50000 VUs, 12662 complete and 0 interrupted iterations
default   [   6% ] 00129/50000 VUs  01m08.7s/20m00.0s

running (01m09.7s), 00132/50000 VUs, 13074 complete and 0 interrupted iterations
default   [   6% ] 00132/50000 VUs  01m09.7s/20m00.0s

running (01m10.7s), 00135/50000 VUs, 13529 complete and 0 interrupted iterations
default   [   6% ] 00135/50000 VUs  01m10.7s/20m00.0s

running (01m11.7s), 00139/50000 VUs, 13956 complete and 0 interrupted iterations
default   [   6% ] 00139/50000 VUs  01m11.7s/20m00.0s

running (01m12.7s), 00142/50000 VUs, 14433 complete and 0 interrupted iterations
default   [   6% ] 00142/50000 VUs  01m12.7s/20m00.0s

running (01m13.7s), 00145/50000 VUs, 14913 complete and 0 interrupted iterations
default   [   6% ] 00145/50000 VUs  01m13.7s/20m00.0s

running (01m14.7s), 00149/50000 VUs, 15381 complete and 0 interrupted iterations
default   [   6% ] 00149/50000 VUs  01m14.7s/20m00.0s

running (01m15.7s), 00152/50000 VUs, 15886 complete and 0 interrupted iterations
default   [   6% ] 00152/50000 VUs  01m15.7s/20m00.0s

running (01m16.7s), 00155/50000 VUs, 16380 complete and 0 interrupted iterations
default   [   6% ] 00155/50000 VUs  01m16.7s/20m00.0s

running (01m17.7s), 00159/50000 VUs, 16882 complete and 0 interrupted iterations
default   [   6% ] 00159/50000 VUs  01m17.7s/20m00.0s

running (01m18.7s), 00162/50000 VUs, 17392 complete and 0 interrupted iterations
default   [   7% ] 00162/50000 VUs  01m18.7s/20m00.0s

running (01m19.7s), 00165/50000 VUs, 17912 complete and 0 interrupted iterations
default   [   7% ] 00165/50000 VUs  01m19.7s/20m00.0s

running (01m20.7s), 00169/50000 VUs, 18445 complete and 0 interrupted iterations
default   [   7% ] 00169/50000 VUs  01m20.7s/20m00.0s

running (01m21.7s), 00172/50000 VUs, 19016 complete and 0 interrupted iterations
default   [   7% ] 00172/50000 VUs  01m21.7s/20m00.0s

running (01m22.7s), 00175/50000 VUs, 19583 complete and 0 interrupted iterations
default   [   7% ] 00175/50000 VUs  01m22.7s/20m00.0s

running (01m23.7s), 00179/50000 VUs, 20149 complete and 0 interrupted iterations
default   [   7% ] 00179/50000 VUs  01m23.7s/20m00.0s

running (01m24.7s), 00182/50000 VUs, 20745 complete and 0 interrupted iterations
default   [   7% ] 00182/50000 VUs  01m24.7s/20m00.0s

running (01m25.7s), 00185/50000 VUs, 21344 complete and 0 interrupted iterations
default   [   7% ] 00185/50000 VUs  01m25.7s/20m00.0s

running (01m26.7s), 00189/50000 VUs, 21947 complete and 0 interrupted iterations
default   [   7% ] 00189/50000 VUs  01m26.7s/20m00.0s

running (01m27.7s), 00192/50000 VUs, 22546 complete and 0 interrupted iterations
default   [   7% ] 00192/50000 VUs  01m27.7s/20m00.0s

running (01m28.7s), 00195/50000 VUs, 23188 complete and 0 interrupted iterations
default   [   7% ] 00195/50000 VUs  01m28.7s/20m00.0s

running (01m29.7s), 00199/50000 VUs, 23842 complete and 0 interrupted iterations
default   [   7% ] 00199/50000 VUs  01m29.7s/20m00.0s

running (01m30.7s), 00202/50000 VUs, 24474 complete and 0 interrupted iterations
default   [   8% ] 00202/50000 VUs  01m30.7s/20m00.0s

running (01m31.7s), 00205/50000 VUs, 25138 complete and 0 interrupted iterations
default   [   8% ] 00205/50000 VUs  01m31.7s/20m00.0s

running (01m32.7s), 00209/50000 VUs, 25800 complete and 0 interrupted iterations
default   [   8% ] 00209/50000 VUs  01m32.7s/20m00.0s

running (01m33.7s), 00212/50000 VUs, 26494 complete and 0 interrupted iterations
default   [   8% ] 00212/50000 VUs  01m33.7s/20m00.0s

running (01m34.7s), 00215/50000 VUs, 27178 complete and 0 interrupted iterations
default   [   8% ] 00215/50000 VUs  01m34.7s/20m00.0s

running (01m35.7s), 00219/50000 VUs, 27878 complete and 0 interrupted iterations
default   [   8% ] 00219/50000 VUs  01m35.7s/20m00.0s

running (01m36.7s), 00222/50000 VUs, 28582 complete and 0 interrupted iterations
default   [   8% ] 00222/50000 VUs  01m36.7s/20m00.0s

running (01m37.7s), 00225/50000 VUs, 29328 complete and 0 interrupted iterations
default   [   8% ] 00225/50000 VUs  01m37.7s/20m00.0s

running (01m38.7s), 00229/50000 VUs, 30067 complete and 0 interrupted iterations
default   [   8% ] 00229/50000 VUs  01m38.7s/20m00.0s

running (01m39.7s), 00232/50000 VUs, 30814 complete and 0 interrupted iterations
default   [   8% ] 00232/50000 VUs  01m39.7s/20m00.0s

running (01m40.7s), 00235/50000 VUs, 31581 complete and 0 interrupted iterations
default   [   8% ] 00235/50000 VUs  01m40.7s/20m00.0s

running (01m41.7s), 00239/50000 VUs, 32322 complete and 0 interrupted iterations
default   [   8% ] 00239/50000 VUs  01m41.7s/20m00.0s

running (01m42.7s), 00242/50000 VUs, 33099 complete and 0 interrupted iterations
default   [   9% ] 00242/50000 VUs  01m42.7s/20m00.0s

running (01m43.7s), 00245/50000 VUs, 33902 complete and 0 interrupted iterations
default   [   9% ] 00245/50000 VUs  01m43.7s/20m00.0s

running (01m44.7s), 00249/50000 VUs, 34704 complete and 0 interrupted iterations
default   [   9% ] 00249/50000 VUs  01m44.7s/20m00.0s

running (01m45.7s), 00252/50000 VUs, 35512 complete and 0 interrupted iterations
default   [   9% ] 00252/50000 VUs  01m45.7s/20m00.0s

running (01m46.7s), 00255/50000 VUs, 36343 complete and 0 interrupted iterations
default   [   9% ] 00255/50000 VUs  01m46.7s/20m00.0s

running (01m47.7s), 00259/50000 VUs, 37204 complete and 0 interrupted iterations
default   [   9% ] 00259/50000 VUs  01m47.7s/20m00.0s

running (01m48.7s), 00262/50000 VUs, 38065 complete and 0 interrupted iterations
default   [   9% ] 00262/50000 VUs  01m48.7s/20m00.0s

running (01m49.7s), 00265/50000 VUs, 38907 complete and 0 interrupted iterations
default   [   9% ] 00265/50000 VUs  01m49.7s/20m00.0s

running (01m50.7s), 00269/50000 VUs, 39766 complete and 0 interrupted iterations
default   [   9% ] 00269/50000 VUs  01m50.7s/20m00.0s

running (01m51.7s), 00272/50000 VUs, 40652 complete and 0 interrupted iterations
default   [   9% ] 00272/50000 VUs  01m51.7s/20m00.0s

running (01m52.7s), 00275/50000 VUs, 41559 complete and 0 interrupted iterations
default   [   9% ] 00275/50000 VUs  01m52.7s/20m00.0s

running (01m53.7s), 00279/50000 VUs, 42474 complete and 0 interrupted iterations
default   [   9% ] 00279/50000 VUs  01m53.7s/20m00.0s

running (01m54.7s), 00282/50000 VUs, 43376 complete and 0 interrupted iterations
default   [  10% ] 00282/50000 VUs  01m54.7s/20m00.0s

running (01m55.7s), 00285/50000 VUs, 44301 complete and 0 interrupted iterations
default   [  10% ] 00285/50000 VUs  01m55.7s/20m00.0s

running (01m56.7s), 00289/50000 VUs, 45265 complete and 0 interrupted iterations
default   [  10% ] 00289/50000 VUs  01m56.7s/20m00.0s

running (01m57.7s), 00292/50000 VUs, 46206 complete and 0 interrupted iterations
default   [  10% ] 00292/50000 VUs  01m57.7s/20m00.0s

running (01m58.7s), 00295/50000 VUs, 47169 complete and 0 interrupted iterations
default   [  10% ] 00295/50000 VUs  01m58.7s/20m00.0s

running (01m59.7s), 00299/50000 VUs, 48127 complete and 0 interrupted iterations
default   [  10% ] 00299/50000 VUs  01m59.7s/20m00.0s

running (02m00.7s), 00302/50000 VUs, 49109 complete and 0 interrupted iterations
default   [  10% ] 00302/50000 VUs  02m00.7s/20m00.0s

running (02m01.7s), 00305/50000 VUs, 50115 complete and 0 interrupted iterations
default   [  10% ] 00305/50000 VUs  02m01.7s/20m00.0s

running (02m02.7s), 00309/50000 VUs, 51115 complete and 0 interrupted iterations
default   [  10% ] 00309/50000 VUs  02m02.7s/20m00.0s

running (02m03.7s), 00312/50000 VUs, 52146 complete and 0 interrupted iterations
default   [  10% ] 00312/50000 VUs  02m03.7s/20m00.0s

running (02m04.7s), 00315/50000 VUs, 53189 complete and 0 interrupted iterations
default   [  10% ] 00315/50000 VUs  02m04.7s/20m00.0s

running (02m05.7s), 00319/50000 VUs, 54210 complete and 0 interrupted iterations
default   [  10% ] 00319/50000 VUs  02m05.7s/20m00.0s

running (02m06.7s), 00322/50000 VUs, 55261 complete and 0 interrupted iterations
default   [  11% ] 00322/50000 VUs  02m06.7s/20m00.0s

running (02m07.7s), 00325/50000 VUs, 56321 complete and 0 interrupted iterations
default   [  11% ] 00325/50000 VUs  02m07.7s/20m00.0s

running (02m08.7s), 00329/50000 VUs, 57368 complete and 0 interrupted iterations
default   [  11% ] 00329/50000 VUs  02m08.7s/20m00.0s

running (02m09.7s), 00332/50000 VUs, 58478 complete and 0 interrupted iterations
default   [  11% ] 00332/50000 VUs  02m09.7s/20m00.0s

running (02m10.7s), 00335/50000 VUs, 59570 complete and 0 interrupted iterations
default   [  11% ] 00335/50000 VUs  02m10.7s/20m00.0s

running (02m11.7s), 00339/50000 VUs, 60672 complete and 0 interrupted iterations
default   [  11% ] 00339/50000 VUs  02m11.7s/20m00.0s

running (02m12.7s), 00342/50000 VUs, 61773 complete and 0 interrupted iterations
default   [  11% ] 00342/50000 VUs  02m12.7s/20m00.0s

running (02m13.7s), 00345/50000 VUs, 62886 complete and 0 interrupted iterations
default   [  11% ] 00345/50000 VUs  02m13.7s/20m00.0s

running (02m14.7s), 00349/50000 VUs, 64030 complete and 0 interrupted iterations
default   [  11% ] 00349/50000 VUs  02m14.7s/20m00.0s

running (02m15.7s), 00352/50000 VUs, 65172 complete and 0 interrupted iterations
default   [  11% ] 00352/50000 VUs  02m15.7s/20m00.0s

running (02m16.7s), 00355/50000 VUs, 66349 complete and 0 interrupted iterations
default   [  11% ] 00355/50000 VUs  02m16.7s/20m00.0s

running (02m17.7s), 00359/50000 VUs, 67511 complete and 0 interrupted iterations
default   [  11% ] 00359/50000 VUs  02m17.7s/20m00.0s

running (02m18.7s), 00362/50000 VUs, 68695 complete and 0 interrupted iterations
default   [  12% ] 00362/50000 VUs  02m18.7s/20m00.0s

running (02m19.7s), 00365/50000 VUs, 69865 complete and 0 interrupted iterations
default   [  12% ] 00365/50000 VUs  02m19.7s/20m00.0s

running (02m20.7s), 00369/50000 VUs, 71070 complete and 0 interrupted iterations
default   [  12% ] 00369/50000 VUs  02m20.7s/20m00.0s

running (02m21.7s), 00372/50000 VUs, 72285 complete and 0 interrupted iterations
default   [  12% ] 00372/50000 VUs  02m21.7s/20m00.0s

running (02m22.7s), 00375/50000 VUs, 73535 complete and 0 interrupted iterations
default   [  12% ] 00375/50000 VUs  02m22.7s/20m00.0s

running (02m23.7s), 00379/50000 VUs, 74755 complete and 0 interrupted iterations
default   [  12% ] 00379/50000 VUs  02m23.7s/20m00.0s

running (02m24.7s), 00382/50000 VUs, 75991 complete and 0 interrupted iterations
default   [  12% ] 00382/50000 VUs  02m24.7s/20m00.0s

running (02m25.7s), 00385/50000 VUs, 77259 complete and 0 interrupted iterations
default   [  12% ] 00385/50000 VUs  02m25.7s/20m00.0s

running (02m26.7s), 00389/50000 VUs, 78501 complete and 0 interrupted iterations
default   [  12% ] 00389/50000 VUs  02m26.7s/20m00.0s

running (02m27.7s), 00392/50000 VUs, 79789 complete and 0 interrupted iterations
default   [  12% ] 00392/50000 VUs  02m27.7s/20m00.0s

running (02m28.7s), 00395/50000 VUs, 81090 complete and 0 interrupted iterations
default   [  12% ] 00395/50000 VUs  02m28.7s/20m00.0s

running (02m29.7s), 00399/50000 VUs, 82379 complete and 0 interrupted iterations
default   [  12% ] 00399/50000 VUs  02m29.7s/20m00.0s

running (02m30.7s), 00402/50000 VUs, 83668 complete and 0 interrupted iterations
default   [  13% ] 00402/50000 VUs  02m30.7s/20m00.0s

running (02m31.7s), 00405/50000 VUs, 84962 complete and 0 interrupted iterations
default   [  13% ] 00405/50000 VUs  02m31.7s/20m00.0s

running (02m32.7s), 00409/50000 VUs, 86321 complete and 0 interrupted iterations
default   [  13% ] 00409/50000 VUs  02m32.7s/20m00.0s

running (02m33.7s), 00412/50000 VUs, 87667 complete and 0 interrupted iterations
default   [  13% ] 00412/50000 VUs  02m33.7s/20m00.0s

running (02m34.7s), 00415/50000 VUs, 88997 complete and 0 interrupted iterations
default   [  13% ] 00415/50000 VUs  02m34.7s/20m00.0s

running (02m35.7s), 00419/50000 VUs, 90399 complete and 0 interrupted iterations
default   [  13% ] 00419/50000 VUs  02m35.7s/20m00.0s

running (02m36.7s), 00422/50000 VUs, 91730 complete and 0 interrupted iterations
default   [  13% ] 00422/50000 VUs  02m36.7s/20m00.0s

running (02m37.7s), 00425/50000 VUs, 93165 complete and 0 interrupted iterations
default   [  13% ] 00425/50000 VUs  02m37.7s/20m00.0s

running (02m38.7s), 00429/50000 VUs, 94537 complete and 0 interrupted iterations
default   [  13% ] 00429/50000 VUs  02m38.7s/20m00.0s

running (02m39.7s), 00432/50000 VUs, 95953 complete and 0 interrupted iterations
default   [  13% ] 00432/50000 VUs  02m39.7s/20m00.0s

running (02m40.7s), 00435/50000 VUs, 97387 complete and 0 interrupted iterations
default   [  13% ] 00435/50000 VUs  02m40.7s/20m00.0s

running (02m41.7s), 00439/50000 VUs, 98821 complete and 0 interrupted iterations
default   [  13% ] 00439/50000 VUs  02m41.7s/20m00.0s

running (02m42.7s), 00442/50000 VUs, 100286 complete and 0 interrupted iterations
default   [  14% ] 00442/50000 VUs  02m42.7s/20m00.0s

running (02m43.7s), 00445/50000 VUs, 101731 complete and 0 interrupted iterations
default   [  14% ] 00445/50000 VUs  02m43.7s/20m00.0s

running (02m44.7s), 00449/50000 VUs, 103150 complete and 0 interrupted iterations
default   [  14% ] 00449/50000 VUs  02m44.7s/20m00.0s

running (02m45.7s), 00452/50000 VUs, 104650 complete and 0 interrupted iterations
default   [  14% ] 00452/50000 VUs  02m45.7s/20m00.0s

running (02m46.7s), 00455/50000 VUs, 106120 complete and 0 interrupted iterations
default   [  14% ] 00455/50000 VUs  02m46.7s/20m00.0s

running (02m47.7s), 00459/50000 VUs, 107618 complete and 0 interrupted iterations
default   [  14% ] 00459/50000 VUs  02m47.7s/20m00.0s

running (02m48.7s), 00462/50000 VUs, 109158 complete and 0 interrupted iterations
default   [  14% ] 00462/50000 VUs  02m48.7s/20m00.0s

running (02m49.7s), 00465/50000 VUs, 110685 complete and 0 interrupted iterations
default   [  14% ] 00465/50000 VUs  02m49.7s/20m00.0s

running (02m50.7s), 00469/50000 VUs, 112219 complete and 0 interrupted iterations
default   [  14% ] 00469/50000 VUs  02m50.7s/20m00.0s

running (02m51.7s), 00472/50000 VUs, 113740 complete and 0 interrupted iterations
default   [  14% ] 00472/50000 VUs  02m51.7s/20m00.0s

running (02m52.7s), 00475/50000 VUs, 115272 complete and 0 interrupted iterations
default   [  14% ] 00475/50000 VUs  02m52.7s/20m00.0s

running (02m53.7s), 00479/50000 VUs, 116879 complete and 0 interrupted iterations
default   [  14% ] 00479/50000 VUs  02m53.7s/20m00.0s

running (02m54.7s), 00482/50000 VUs, 118495 complete and 0 interrupted iterations
default   [  15% ] 00482/50000 VUs  02m54.7s/20m00.0s

running (02m55.7s), 00485/50000 VUs, 120095 complete and 0 interrupted iterations
default   [  15% ] 00485/50000 VUs  02m55.7s/20m00.0s

running (02m56.7s), 00489/50000 VUs, 121692 complete and 0 interrupted iterations
default   [  15% ] 00489/50000 VUs  02m56.7s/20m00.0s

running (02m57.7s), 00492/50000 VUs, 123310 complete and 0 interrupted iterations
default   [  15% ] 00492/50000 VUs  02m57.7s/20m00.0s

running (02m58.7s), 00495/50000 VUs, 124929 complete and 0 interrupted iterations
default   [  15% ] 00495/50000 VUs  02m58.7s/20m00.0s

running (02m59.7s), 00499/50000 VUs, 126584 complete and 0 interrupted iterations
default   [  15% ] 00499/50000 VUs  02m59.7s/20m00.0s

running (03m00.7s), 00506/50000 VUs, 128197 complete and 0 interrupted iterations
default   [  15% ] 00506/50000 VUs  03m00.7s/20m00.0s

running (03m01.7s), 00514/50000 VUs, 129844 complete and 0 interrupted iterations
default   [  15% ] 00514/50000 VUs  03m01.7s/20m00.0s

running (03m02.7s), 00522/50000 VUs, 131541 complete and 0 interrupted iterations
default   [  15% ] 00522/50000 VUs  03m02.7s/20m00.0s

running (03m03.7s), 00531/50000 VUs, 133287 complete and 0 interrupted iterations
default   [  15% ] 00531/50000 VUs  03m03.7s/20m00.0s

running (03m04.7s), 00539/50000 VUs, 135036 complete and 0 interrupted iterations
default   [  15% ] 00539/50000 VUs  03m04.7s/20m00.0s

running (03m05.7s), 00547/50000 VUs, 136857 complete and 0 interrupted iterations
default   [  15% ] 00547/50000 VUs  03m05.7s/20m00.0s

running (03m06.7s), 00556/50000 VUs, 138666 complete and 0 interrupted iterations
default   [  16% ] 00556/50000 VUs  03m06.7s/20m00.0s

running (03m07.7s), 00564/50000 VUs, 140510 complete and 0 interrupted iterations
default   [  16% ] 00564/50000 VUs  03m07.7s/20m00.0s

running (03m08.7s), 00572/50000 VUs, 142355 complete and 0 interrupted iterations
default   [  16% ] 00572/50000 VUs  03m08.7s/20m00.0s

running (03m09.7s), 00581/50000 VUs, 144265 complete and 0 interrupted iterations
default   [  16% ] 00581/50000 VUs  03m09.7s/20m00.0s

running (03m10.7s), 00589/50000 VUs, 146177 complete and 0 interrupted iterations
default   [  16% ] 00589/50000 VUs  03m10.7s/20m00.0s

running (03m11.7s), 00597/50000 VUs, 148103 complete and 0 interrupted iterations
default   [  16% ] 00597/50000 VUs  03m11.7s/20m00.0s

running (03m12.7s), 00606/50000 VUs, 150084 complete and 0 interrupted iterations
default   [  16% ] 00606/50000 VUs  03m12.7s/20m00.0s

running (03m13.7s), 00614/50000 VUs, 152084 complete and 0 interrupted iterations
default   [  16% ] 00614/50000 VUs  03m13.7s/20m00.0s

running (03m14.7s), 00622/50000 VUs, 154185 complete and 0 interrupted iterations
default   [  16% ] 00622/50000 VUs  03m14.7s/20m00.0s

running (03m15.7s), 00631/50000 VUs, 156240 complete and 0 interrupted iterations
default   [  16% ] 00631/50000 VUs  03m15.7s/20m00.0s

running (03m16.7s), 00639/50000 VUs, 158333 complete and 0 interrupted iterations
default   [  16% ] 00639/50000 VUs  03m16.7s/20m00.0s

running (03m17.7s), 00647/50000 VUs, 160453 complete and 0 interrupted iterations
default   [  16% ] 00647/50000 VUs  03m17.7s/20m00.0s

running (03m18.7s), 00655/50000 VUs, 162607 complete and 0 interrupted iterations
default   [  17% ] 00655/50000 VUs  03m18.7s/20m00.0s

running (03m19.7s), 00664/50000 VUs, 164777 complete and 0 interrupted iterations
default   [  17% ] 00664/50000 VUs  03m19.7s/20m00.0s

running (03m20.7s), 00672/50000 VUs, 166957 complete and 0 interrupted iterations
default   [  17% ] 00672/50000 VUs  03m20.7s/20m00.0s

running (03m21.7s), 00681/50000 VUs, 169198 complete and 0 interrupted iterations
default   [  17% ] 00681/50000 VUs  03m21.7s/20m00.0s

running (03m22.7s), 00689/50000 VUs, 171434 complete and 0 interrupted iterations
default   [  17% ] 00689/50000 VUs  03m22.7s/20m00.0s

running (03m23.7s), 00697/50000 VUs, 173764 complete and 0 interrupted iterations
default   [  17% ] 00697/50000 VUs  03m23.7s/20m00.0s

running (03m24.7s), 00706/50000 VUs, 176094 complete and 0 interrupted iterations
default   [  17% ] 00706/50000 VUs  03m24.7s/20m00.0s

running (03m25.7s), 00714/50000 VUs, 178418 complete and 0 interrupted iterations
default   [  17% ] 00714/50000 VUs  03m25.7s/20m00.0s

running (03m26.7s), 00722/50000 VUs, 180758 complete and 0 interrupted iterations
default   [  17% ] 00722/50000 VUs  03m26.7s/20m00.0s

running (03m27.7s), 00730/50000 VUs, 183132 complete and 0 interrupted iterations
default   [  17% ] 00730/50000 VUs  03m27.7s/20m00.0s

running (03m28.7s), 00739/50000 VUs, 185525 complete and 0 interrupted iterations
default   [  17% ] 00739/50000 VUs  03m28.7s/20m00.0s

running (03m29.7s), 00747/50000 VUs, 187960 complete and 0 interrupted iterations
default   [  17% ] 00747/50000 VUs  03m29.7s/20m00.0s

running (03m30.7s), 00755/50000 VUs, 190469 complete and 0 interrupted iterations
default   [  18% ] 00755/50000 VUs  03m30.7s/20m00.0s

running (03m31.7s), 00764/50000 VUs, 192984 complete and 0 interrupted iterations
default   [  18% ] 00764/50000 VUs  03m31.7s/20m00.0s

running (03m32.7s), 00772/50000 VUs, 195552 complete and 0 interrupted iterations
default   [  18% ] 00772/50000 VUs  03m32.7s/20m00.0s

running (03m33.7s), 00781/50000 VUs, 198127 complete and 0 interrupted iterations
default   [  18% ] 00781/50000 VUs  03m33.7s/20m00.0s

running (03m34.7s), 00789/50000 VUs, 200714 complete and 0 interrupted iterations
default   [  18% ] 00789/50000 VUs  03m34.7s/20m00.0s

running (03m35.7s), 00797/50000 VUs, 203354 complete and 0 interrupted iterations
default   [  18% ] 00797/50000 VUs  03m35.7s/20m00.0s

running (03m36.7s), 00806/50000 VUs, 205972 complete and 0 interrupted iterations
default   [  18% ] 00806/50000 VUs  03m36.7s/20m00.0s

running (03m37.7s), 00814/50000 VUs, 208482 complete and 0 interrupted iterations
default   [  18% ] 00814/50000 VUs  03m37.7s/20m00.0s

running (03m38.7s), 00822/50000 VUs, 211159 complete and 0 interrupted iterations
default   [  18% ] 00822/50000 VUs  03m38.7s/20m00.0s

running (03m39.7s), 00830/50000 VUs, 213912 complete and 0 interrupted iterations
default   [  18% ] 00830/50000 VUs  03m39.7s/20m00.0s

running (03m40.7s), 00839/50000 VUs, 216676 complete and 0 interrupted iterations
default   [  18% ] 00839/50000 VUs  03m40.7s/20m00.0s

running (03m41.7s), 00847/50000 VUs, 219440 complete and 0 interrupted iterations
default   [  18% ] 00847/50000 VUs  03m41.7s/20m00.0s

running (03m42.7s), 00856/50000 VUs, 222236 complete and 0 interrupted iterations
default   [  19% ] 00856/50000 VUs  03m42.7s/20m00.0s

running (03m43.7s), 00864/50000 VUs, 225051 complete and 0 interrupted iterations
default   [  19% ] 00864/50000 VUs  03m43.7s/20m00.0s

running (03m44.7s), 00872/50000 VUs, 227907 complete and 0 interrupted iterations
default   [  19% ] 00872/50000 VUs  03m44.7s/20m00.0s

running (03m45.7s), 00881/50000 VUs, 230800 complete and 0 interrupted iterations
default   [  19% ] 00881/50000 VUs  03m45.7s/20m00.0s

running (03m46.7s), 00889/50000 VUs, 233767 complete and 0 interrupted iterations
default   [  19% ] 00889/50000 VUs  03m46.7s/20m00.0s

running (03m47.7s), 00897/50000 VUs, 236703 complete and 0 interrupted iterations
default   [  19% ] 00897/50000 VUs  03m47.7s/20m00.0s

running (03m48.7s), 00906/50000 VUs, 239649 complete and 0 interrupted iterations
default   [  19% ] 00906/50000 VUs  03m48.7s/20m00.0s

running (03m49.7s), 00914/50000 VUs, 242671 complete and 0 interrupted iterations
default   [  19% ] 00914/50000 VUs  03m49.7s/20m00.0s

running (03m50.7s), 00922/50000 VUs, 245712 complete and 0 interrupted iterations
default   [  19% ] 00922/50000 VUs  03m50.7s/20m00.0s

running (03m51.7s), 00931/50000 VUs, 248813 complete and 0 interrupted iterations
default   [  19% ] 00931/50000 VUs  03m51.7s/20m00.0s

running (03m52.7s), 00939/50000 VUs, 251902 complete and 0 interrupted iterations
default   [  19% ] 00939/50000 VUs  03m52.7s/20m00.0s

running (03m53.7s), 00947/50000 VUs, 255035 complete and 0 interrupted iterations
default   [  19% ] 00947/50000 VUs  03m53.7s/20m00.0s

running (03m54.7s), 00956/50000 VUs, 258126 complete and 0 interrupted iterations
default   [  20% ] 00956/50000 VUs  03m54.7s/20m00.0s

running (03m55.7s), 00964/50000 VUs, 261323 complete and 0 interrupted iterations
default   [  20% ] 00964/50000 VUs  03m55.7s/20m00.0s

running (03m56.7s), 00972/50000 VUs, 264498 complete and 0 interrupted iterations
default   [  20% ] 00972/50000 VUs  03m56.7s/20m00.0s

running (03m57.7s), 00981/50000 VUs, 267700 complete and 0 interrupted iterations
default   [  20% ] 00981/50000 VUs  03m57.7s/20m00.0s

running (03m58.7s), 00989/50000 VUs, 270927 complete and 0 interrupted iterations
default   [  20% ] 00989/50000 VUs  03m58.7s/20m00.0s

running (03m59.7s), 00997/50000 VUs, 274212 complete and 0 interrupted iterations
default   [  20% ] 00997/50000 VUs  03m59.7s/20m00.0s

running (04m00.7s), 01006/50000 VUs, 277556 complete and 0 interrupted iterations
default   [  20% ] 01006/50000 VUs  04m00.7s/20m00.0s

running (04m01.7s), 01014/50000 VUs, 280858 complete and 0 interrupted iterations
default   [  20% ] 01014/50000 VUs  04m01.7s/20m00.0s

running (04m02.7s), 01022/50000 VUs, 284207 complete and 0 interrupted iterations
default   [  20% ] 01022/50000 VUs  04m02.7s/20m00.0s

running (04m03.7s), 01031/50000 VUs, 287588 complete and 0 interrupted iterations
default   [  20% ] 01031/50000 VUs  04m03.7s/20m00.0s

running (04m04.7s), 01039/50000 VUs, 290916 complete and 0 interrupted iterations
default   [  20% ] 01039/50000 VUs  04m04.7s/20m00.0s

running (04m05.7s), 01047/50000 VUs, 294266 complete and 0 interrupted iterations
default   [  20% ] 01047/50000 VUs  04m05.7s/20m00.0s

running (04m06.7s), 01056/50000 VUs, 297607 complete and 0 interrupted iterations
default   [  21% ] 01056/50000 VUs  04m06.7s/20m00.0s

running (04m07.7s), 01064/50000 VUs, 300922 complete and 0 interrupted iterations
default   [  21% ] 01064/50000 VUs  04m07.7s/20m00.0s

running (04m08.7s), 01072/50000 VUs, 304263 complete and 0 interrupted iterations
default   [  21% ] 01072/50000 VUs  04m08.7s/20m00.0s

running (04m09.7s), 01081/50000 VUs, 307611 complete and 0 interrupted iterations
default   [  21% ] 01081/50000 VUs  04m09.7s/20m00.0s

running (04m10.7s), 01089/50000 VUs, 310962 complete and 0 interrupted iterations
default   [  21% ] 01089/50000 VUs  04m10.7s/20m00.0s

running (04m11.7s), 01097/50000 VUs, 314325 complete and 0 interrupted iterations
default   [  21% ] 01097/50000 VUs  04m11.7s/20m00.0s

running (04m12.7s), 01106/50000 VUs, 317720 complete and 0 interrupted iterations
default   [  21% ] 01106/50000 VUs  04m12.7s/20m00.0s

running (04m13.7s), 01114/50000 VUs, 321058 complete and 0 interrupted iterations
default   [  21% ] 01114/50000 VUs  04m13.7s/20m00.0s

running (04m14.7s), 01122/50000 VUs, 324360 complete and 0 interrupted iterations
default   [  21% ] 01122/50000 VUs  04m14.7s/20m00.0s

running (04m15.7s), 01131/50000 VUs, 327756 complete and 0 interrupted iterations
default   [  21% ] 01131/50000 VUs  04m15.7s/20m00.0s

running (04m16.7s), 01139/50000 VUs, 331119 complete and 0 interrupted iterations
default   [  21% ] 01139/50000 VUs  04m16.7s/20m00.0s

running (04m17.7s), 01147/50000 VUs, 334447 complete and 0 interrupted iterations
default   [  21% ] 01147/50000 VUs  04m17.7s/20m00.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1500' p(95)=6.11ms

    http_req_failed
    ✗ 'rate<0.1' rate=10.15%


  █ TOTAL RESULTS 

    checks_total.......: 335625 1301.898137/s
    checks_succeeded...: 89.84% 301548 out of 335625
    checks_failed......: 10.15% 34077 out of 335625

    ✗ status is 200
      ↳  89% — ✓ 301548 / ✗ 34077

    HTTP
    http_req_duration..............: avg=3.23ms  min=53.3µs   med=975.65µs max=3.02s    p(90)=4.39ms   p(95)=6.11ms  
      { expected_response:true }...: avg=1.97ms  min=74.68µs  med=1.04ms   max=126.78ms p(90)=4.66ms   p(95)=6.33ms  
    http_req_failed................: 10.15% 34077 out of 335625
    http_reqs......................: 335625 1301.898137/s

    EXECUTION
    iteration_duration.............: avg=303.9ms min=100.33ms med=302.58ms max=3.49s    p(90)=462.59ms p(95)=482.63ms
    iterations.....................: 334625 1298.019111/s
    vus............................: 1147   min=0               max=1147 
    vus_max........................: 50000  min=20711           max=50000

    NETWORK
    data_received..................: 943 MB 3.7 MB/s
    data_sent......................: 29 MB  113 kB/s



running (04m17.9s), 00000/50000 VUs, 334625 complete and 1147 interrupted iterations
default ✗ [  21% ] 00915/50000 VUs  04m17.8s/20m00.0s

STDERR:
time="2026-04-07T21:32:12-04:00" level=error msg="thresholds on metrics 'http_req_failed' were crossed; at least one has abortOnFail enabled, stopping test prematurely"